tap "homebrew/services"
tap "thought-machine/please"

brew "postgresql@14", restart_service: true
brew "the_silver_searcher"
brew "golang"
brew "git"
brew "pkg-config"
brew "coreutils"
brew "age"
brew "vale"
brew "please"
brew "htop"
brew "jq"
brew "curl"
brew "tmux"
brew "wget", with_iri: true
brew "pv"
brew "ssh-copy-id"
brew "tree"

cask "font-fantasque-sans-mono"

cask_args appdir: "~/Applications"
cask "google-chrome"
cask "1password"
cask "slack"
cask "zoom"
cask "visual-studio-code"
cask "alacritty"

vscode "bierner.github-markdown-preview"
vscode "tamasfe.even-better-toml"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "golang.go"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "please-build.plz-vscode"
vscode "eamodio.gitlens"
vscode "wayou.vscode-todo-highlight"